Tekla.Structures.Drawing.Mark.MarkAttributes
The MarkAttributes class defines the mark attributes.

Tekla.Structures.Drawing.Mark.MarkAttributes.Content
The mark content as a list of elements.

Tekla.Structures.Drawing.Mark.MarkAttributes.#ctor(Tekla.Structures.Drawing.ModelObject)
Creates a new default mark attributes instance that loads standard attributes.
modelObject: The ModelObject defining the content to load.

Tekla.Structures.Drawing.Mark.MarkAttributes.#ctor(Tekla.Structures.Drawing.ModelObject,System.String)
Creates a new mark attributes instance that loads the specified attributes.
modelObject: The ModelObject defining the content to load.
AttributesFile: The attributes file's filename.

Tekla.Structures.Drawing.Mark.MarkAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.Mark.MarkAttributes.LoadAttributes(System.String)
Loads attributes from the attribute file.
attributeFilename: The filename of the attribute file.
Returns: True on success.